-- phpMyAdmin SQL Dump
-- version 4.6.6
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Feb 29, 2020 at 11:14 AM
-- Server version: 5.7.17-log
-- PHP Version: 5.6.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `flower2`
--

-- --------------------------------------------------------

--
-- Table structure for table `products`
--

CREATE TABLE `products` (
  `p_id` varchar(5) NOT NULL,
  `p_name` varchar(30) NOT NULL,
  `p_description` varchar(300) NOT NULL,
  `p_category` varchar(30) NOT NULL,
  `p_image_id` varchar(500) NOT NULL,
  `p_price` int(11) NOT NULL,
  `p_available` tinyint(1) NOT NULL,
  `p_stock` int(11) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `products`
--

INSERT INTO `products` (`p_id`, `p_name`, `p_description`, `p_category`, `p_image_id`, `p_price`, `p_available`, `p_stock`) VALUES
('1', 'ดอกเข็ม', 'เป็นพรรณไม้พุ่มขนาดเล็กถึงขนาดย่อม ลำต้นสูงประมาณ 3–5 ฟุต จะแตกกิ่งก้านสาขาออกแผ่เป็นพุ่ม ลำต้นเป็นต้นเดี่ยวหรือแตกกอแผ่สาขาออกไปเป็นต้นต้นเล็กกลมขนาดเส้นรอบวงประมาณ 4-10 เซนติเมตรลำต้นเรียบสีน้ำตาลกิ่งยอดมีสีเขียวแตกกิ่งตรงขึ้นด้านบน', '1', '1', 30, 1, 100),
('2', 'ดอกเดซี่', 'เป็นไม้ล้มลุกปีเดียว สูง 15-30 เซนติเมตร ทรงพุ่มแผ่ไปกับผิวดิน ขอบใบหยักลึกสุดแบบขนนก เป็นเส้นฝอยละเอียดเรียวเล็ก สีเขียว ใบมักมีกลิ่นหอม ดอก เป็นช่อแบบช่อกระจุก ดอกสีเหลือง ออกตามปลายกิ่ง  ดอกวงนอกรูปขอบขนาน ปลายมน สีเหลือง ดอกวงในรูปหลอด สีเหลืองอมส้ม อยู่เป็นกระจุกกลางดอก ออกดอกตลอดปี', '1', '2', 80, 1, 100),
('3', 'ดอกพิทูเนีย', 'ดอกพิทูเนีย จัดเป็นไม้ประดับดอกต่างประเทศที่นิยมปลูกมากชนิดหนึ่ง เนื่องจาก ดอกมีขนาดใหญ่ กลีบดอกมีหลายสี และมีสีสดใส ลำต้นมีขนาดเล็ก สามารถปลูก และเติบโตได้ดีทั้งในกระถาง และปลูกในแปลงจัดสวน นอกจากนั้น ยังออกดอกได้ต่อเนื่องหลายปี', '1', '3', 60, 1, 100),
('4', 'ดอกยิปโซ', 'ดอกยิปโซ เป็นดอกไม้เมืองหนาวมีลักษณะฝอยๆ ดอกเล็กๆหลากหลายสี ดอกยิปโซแม้แห้งแล้วก็ยังคงสภาพเป็นดอกที่สวยงามอยู่ได้คงทน ความหมายของดอกยิปโซสื่อถึงความ บริสุทธุ์ จริงใจ อ่อนหวาน และรักแรกพบ เหมาะสำหรับให้กับคนที่เราตกหลุมรักตั้งแต่แรกเจอ จึงได้ชื่อว่า ดอกไม้แห่งรักแรก', '1', '4', 80, 1, 100),
('5', 'กล้วยไม้ดิน', 'เป็นกล้วยไม้ดิน เติบโตใต้ต้นไม้ใหญ่ในป่าหนาว กล้วยไม้มีเหง้าซึ่งเหง้าจะพัฒนาเป็นลำลูกกล้วย และมีใบประมาณ 3-4 ใบ จะออกดอกในช่วงฤดูใบไม้ผลิ ช่อดอกมีความยาวประมาณ 10-20 ซม กล้วยไม้ชนิดนี้จะทิ้งใบและหยุดการเจริญเติบโตเพื่อพักตัว และจะเจริญเติบโตต่อในฤดูใบไม้ผลิ', '1', '5', 100, 1, 100),
('6', 'บานบุรี', 'จัดเป็นพรรณไม้พุ่มกึ่งเลื้อย หรือเป็นไม้เถาอาศัยต้นไม้อื่นเพื่อพยุงตัวขึ้นไป ลำต้นหรือเถามีลักษณะกลมเรียบและเป็นสีน้ำตาลทุกส่วนของต้นมียางสีขาวข้น ปลูกเลี้ยงได้ง่าย เติบโตเร็ว ทนความแล้งและดินเค็มได้ดี มักขึ้นกลางแจ้ง ชอบแสงแดดแบบเต็มวัน แต่อยู่ได้ทั้งในที่ร่มรำไรและที่มีแสงแดดจัด  ', '1', '6', 70, 1, 100),
('7', 'ดอกผีเสื้อ', 'ลักษณะโดยทั่วไป ขึ้นเป็นพุ่มใบมีสีเขียวแก่ ลักษณะใบยาวปลายเรียวแหลม ใบจะออกเป็นคู่แบบสลับ โดยใบจะหุ้มรอบข้อทำให้ส่วนข้อมีลักษณะบวมโต ดอกมีทั้งชนิดดอกซ้อนและดอกชั้นเดียว ปลายกลีบดอกจะมีลักษณะจักๆ คล้ายฟันปลาหรือ ฟันเลื่อย สีของดอกมีหลายสี คือ ขาว ชมพู แดง แดงอมม่วง และอาจมีสองสีในดอกเดียวกันก็ได้', '1', '7', 60, 1, 100),
('8', 'ดอกเบญจมาศ', 'เป็นไม้ล้มลุกลำต้นทรงกระบอก แตกกิ่งก้านไม่มากใบเดี่ยว เรียงสลับ รูปใบหอกหรือรูปไข่ ปลายแหลม ออกดอกเป็นช่อกระจุกแน่น บริเวณซอกใบหรือปลายกิ่ง ดอกหลายสี เช่น ดอกสีเหลือง ดอกสีชมพู ดอกสีขาว กลีบเลี้ยงสีเขียว  เรียงซ้อนกันหลายชั้น กลีบดอกมี 2 ชั้น ชั้นนอกรูปไข่หรือรูปรี ซ้อนกันหลายชั้น ชั้นในขนาดเล็ก ', '1', '8', 100, 1, 100),
('9', 'ดอกพุดพิชญา', '', '1', '9', 120, 1, 100),
('10', 'กล้วยไม้ ', 'เป็นพืชใบเลี้ยงเดี่ยว มีลักษณะการเจริญเติบโตแบบซิมโพเดียล คือ เป็นกล้วยไม้ที่มีลำลูกกล้วยเมื่อลำต้นเจริญเติบโตเต็มที่แล้วจะแตกหน่อเป็นลำต้นใหม่และเป็นกอ ดอกช่อออกตามซอกใบ ดอกเรียงสลับ 6-8 คู่', '1', '10', 150, 1, 100),
('11', 'เฟิร์นข้าหลวงหลังลาย', 'เป็นลักษณะของกาฝากใบของเฟิร์นข้าหลวง จะมีสีเขียวอ่อน ขอบใบหยักเป็นคลื่น ก้านใบจะมีสีน้ำตาลเข้ม การเรียงตัวของใบจะเรียงตัวแบบเกลียวคล้ายดอกกุหลาบ ใบที่เกิดใหม่จะอ่อนและเปราะหักได้ง่ายแต่พอเจริญเติบโตเต็มที่แล้วจะมีความเหนียวและหนามาก', '1', '11', 190, 1, 100),
('12', 'ต้นไทรใบด่าง', 'ปลูกเป็นไม้ประธานในสวน ริมทางเดิน ในสวนสาธารณะ หรือปลูกลงกระถางก็ได้ ทนทานต่อสภาพแวดล้อมต่างๆ ได้ดี แต่ถ้าปลูกในที่แห้งแล้ง ใบจะร่วงมาก ต้นที่ได้จากการปักชำกิ่งหรือเสียบยอดจะแตกพุ่มใหม่ได้แน่น ไทรย้อยใบแหลมมีประสิทธิภาพสูงในการดูดซับมลพิษในอากาศ โดยเฉพาะสารพิษประเภทฟอร์มาลดีไฮด์', '1', '12', 140, 1, 100),
('13', 'ต้นไทรโกสน', 'เป็นไม้ใบประดับที่นิยมปลูกชนิดหนึ่ง เนื่องจากใบมีลวดลายแปลกตา และสีสันสวยงาม มีลำต้น และทรงพุ่มขนาดเล็ก มีใบดก เติบโตได้ดีในที่แจ้ง ทนต่อต่อสภาพแวดล้อมต่างๆได้ดี และไม่ต้องดูแลพิถีพิถันมาก', '1', '13', 130, 1, 100),
('14', 'ต้นเฟิร์นใบมะขาม', 'เป็นไม้คลุมดิน สูง 10-20 เซนติเมตร ชอบแสงปานกลาง ชอบความชื้นปานกลางชอบดินที่มีอินทรีย์วัตถุสูง ลำต้นมีเหง้าและไหลเลื้อย และงอกเป็นไม้ใหม่ได้ตลอดเวลา ลักษณะคล้ายใบมะขาม จัดปรกขอบภาชนะด้านหน้าหรือส่วนอื่นๆแล้วแต่ความสูง ขยายพันธุ์ด้วยการแยกไหล หรือหน่อใบประกอบแบบขนนก ', '2', '14', 160, 1, 100),
('15', 'ต้นสนไทรเงิน', 'เป็นต้นไม้ที่สูงได้มากกว่า 4 เมตร. ทรงพุ่มแผ่กว้างเป็นแผง ประมาณ 2 เมตร จึงต้องมีการตัดแต่งอยู่เสมอทั้งทรงพุ่มและความสูง และด้วยทรงพุ่มที่สวยงาม จึงนิยมนำมาปลูกเป็นไม้ประธานของสวน ส่วนใหญ่แล้วมักจะจับกลุ่มๆ กลุ่มละ 3-5 ต้น ใบสีเขียวเข้ม แผ่ออกลักษณะเป็นแผงกว้าง รูปทรงดูสง่างาม', '2', '15', 150, 1, 100),
('16', 'ต้นสนลิ้นมังกร', 'มีลักษณะรูปทรงพีระมิดความสูง 3-12 เมตร ลำต้นสีน้ำตาลเข้มแดงเล็กน้อย ใบสีเขียวเข้ม ไม่ผลัดใบ ขึ้นได้ดีในดินทั่วไป ความชื้นปานกลาง ชอบแสงเต็มวัน นิยมปลูกเป็นไม้ประธานในการจัดสวน นิยมปลูกเป็นกลุ่ม 3 หรือ 5 ต้น ปลูกเป็นแนวถนน การดูแลไม่ควรรดน้ำทรงพุ่มเพราะจะแตกทรงพุ่มไม่สวย', '2', '16', 170, 1, 100),
('17', 'ต้นมอนสเตอร่าด่าง', 'เป็นไม้ประดับที่มีใบสวยงามและเป็นไม้มงคล มีสีสันที่หลากหลายแปลกตาและเป็นเอกลักษณ์  มอนสเตอร่า ช่วยกำจัดสารพวกฟอร์มาลดีไฮด์ (Formaldehyde หรือ CH2O เป็นก็าซไม่มีสีจัดเป็นพิษที่ปนเปื้อนในอากาศและเป็นอันตรายต่อสุขภาพของมนุษย์ ทั้งในระยะสั้นและระยะยาว) จึงปลูกในห้องนอน ห้องนั่งเล่นได้', '2', '17', 150, 1, 100),
('18', 'ต้นเกล็ดทับทิบ', 'เกล็ดทับทิม เป็นไม้พุ่ม ขนาดเล็กค่อนข้างเตี้ย อายุหลายปี ลำต้นสีแดงอ่อนจนถึงสีแดงเข้ม มีขนสั้นปกคลุม แตกกิ่งก้านมาก ดอกเป็นช่อแบบช่อเชิงลด ออกตามซอกใบบริเวณปลายกิ่ง ดอกสีขาว มีขนาดเล็ก', '2', '18', 60, 2, 100),
('19', 'ต้นอโกลนีมาอัญมณีแดง', 'เป็นไม้ประดับที่มีความสวยงามที่ใบ ได้ชื่อว่าเป็นราชาแห่งไม้ประดับ สามารถวางประดับได้ทั้งในและนอกอาคาร เป็นลำดับพืชที่มีมากกว่า 40 ชนิด ปัจจุบันมีการปรับปรุงพันธุ์เพื่อให้มีสีสันสวยงาม นิยมเพาะเลี้ยงเพื่อความสวยงามและจัดเป็นไม้มงคลใช้ใบประกอบการจัดดอกไม้ ได้รับความนิยมจากตลาดทั้งในและต่างประเทศ', '2', '19', 100, 1, 100),
('20', 'ต้นคริสติน่า', 'ลักษณะทั่วไปของไม้ชนิดนี้ เป็นไม้ทรงพุ่มขนาดกลาง ชอบอยู่กลางแจ้งเมื่อโตเต็มที่สามารถสูงได้ 9-10 เมตร ใบเดี่ยวปลายใบเรียวแหลม เวลาใบอ่อนแตกออกมาใหม่จะมีสีแดงเป็นมันสวยงามมาก เป็นพันธ์ไม้ที่ชอบแดด', '2', '20', 130, 1, 100),
('21', 'กระถางซีเมนต์คางหมู', 'ขนาด50*100*50', '2', '21', 350, 1, 100),
('22', 'กระถางดินเผาแบบมีลาย', 'ขนาด20*60*20', '2', '22', 50, 1, 100),
('23', 'กระถางซีเมนต์คางหมูมีลาย', 'ขนาด50*100*50', '2', '23', 50, 1, 100),
('24', 'กระถางดินเผาทรงกลม', 'ขนาด20*60*20', '2', '24', 50, 1, 100),
('25', 'กระถางซีเมนต์คางหมูแบบสี', 'ขนาด50*100*50', '2', '25', 50, 1, 100),
('26', 'ดินปลูกถุงขาว', 'ดินผสมปุ๋ยคอก ปุ๋ยชีวภาพ แกลบ ขุยมะพร้าว มะพร้าวสับ สำหรับปลูกต้นไม้ทุกประเภท ทั้งไม้ดอก ไม้ประดับ ไม้กระถาง', '2', '26', 25, 1, 100),
('27', 'ดินปลูกถุงสีน้ำเงิน', 'ดินชีวภาพพร้อมปลูก', '2', '27', 15, 1, 100);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `u_name` varchar(300) NOT NULL,
  `u_id` varchar(300) NOT NULL,
  `u_password` varchar(300) NOT NULL,
  `u_phone` varchar(300) NOT NULL,
  `u_address` varchar(300) NOT NULL,
  `u_pincode` varchar(300) NOT NULL,
  `u_verified` tinyint(1) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`u_name`, `u_id`, `u_password`, `u_phone`, `u_address`, `u_pincode`, `u_verified`) VALUES
('มด', '1234', '1234', '000000000', '12321', '99999', 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`u_id`);

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
